#include <iostream>
using namespace std;

int main() {
	int T;
	long long int x, y;
	long long int i;
	long long int d;
	cin >> T;
	for (int a = 0; a < T; a++) {
		cin >> x >> y;
		d = y - x;
		i = 0;
		while (true) {
			if (d >= (long long int)(i * i + i + 1) && d <= (long long int)(i * i + 3 * i + 2)) {
				if (d <= i * i + 2 * i + 1) {
					cout << 2 * i + 1 << " ";
				}
				else {
					cout << 2 * i + 2 << " ";
				}
				break;
			}
			i++;
		}
		cout << endl;
	}
	/*
	1 -> X
	12 -> 1 -> 1				x = 1
	123 -> 11 -> 2				x = 2
	1234 -> 111 -> 3			x = 3
	12345 -> 121 -> 3			x = 4
	123456 -> 1211 -> 4			x = 5
	1234567 -> 1221 -> 4		x = 6
	12345678 -> 12121 -> 5		x = 7
	123456789 -> 12221 -> 5		x = 8
	1...10 -> 12321 -> 5		x = 9
	1...11 -> 122222 -> 6		x = 10
	1...12 -> 123221 -> 6		x = 11
	1...13 -> 123321 -> 6		x = 12
	1...14 -> 1223221 -> 7		x = 13

	x	1 2 / 3 4 5 6 / 7 8 9 10 11 12 / 13 14 15 16 17 18 19 20
	A	1 2 / 3 3 4 4 / 5 5 5 6  6  6  / 7  7  7  7  8  8  8  8

	i    0       1           2                      3

	(1) i=0,1,2,3 -> x=1,3,7,13(첫 수) -> i(i+1)/2*2+1=i^2+i+1
	(2) i=0,1,2,3 -> x=2,6,12,20(끝 수) -> (i^2+i+1)+2i+2-1=i^2+3i+2
	(3) i=0,1,2,3 -> x=1,4,9,16(숫자가 바뀌는 지점) -> (i+1)^2=i^2+2i+1

	(1)과 (3) 사이에 숫자가 있다면 2*i+1이 정답
	(3)과 (2) 사이에 숫자가 있다면 2*i+2가 정답

	*/
	return 0;
}